In [69]:
import pandas as pd
import numpy as np

x_train = pd.read_csv('titanic_x_train.csv', encoding = 'cp949')
y_train = pd.read_csv('titanic_y_train.csv', encoding = 'cp949')
x_test = pd.read_csv('titanic_x_test.csv', encoding = 'cp949')

In [70]:
x_test_passid = x_test['PassengerId']
x_train.drop(columns=['PassengerId', '객실번호', '승객이름','티켓번호','나이'], inplace=True)
x_test.drop(columns=['PassengerId', '객실번호', '승객이름','티켓번호','나이'], inplace=True)

In [71]:
x_train.head()

   티켓등급      성별  형제자매배우자수  부모자식수     운임요금 선착장
0     3    male         1      0   7.2500   S
1     1  female         1      0  71.2833   C
2     3  female         0      0   7.9250   S
3     1  female         1      0  53.1000   S
4     3    male         0      0   8.0500   S

In [72]:
x_test.head()

   티켓등급      성별  형제자매배우자수  부모자식수     운임요금 선착장
0     3    male         0      0   7.8292   Q
1     3  female         1      0   7.0000   S
2     2    male         0      0   9.6875   Q
3     3    male         0      0   8.6625   S
4     3  female         1      1  12.2875   S

In [73]:
y_train.columns = ['PassengerId', 'Survived']

y_train.head()

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [74]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   티켓등급      891 non-null    int64
 1   성별        891 non-null    object
 2   형제자매배우자수  891 non-null    int64
 3   부모자식수     891 non-null    int64
 4   운임요금      891 non-null    float64
 5   선착장       889 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 41.9+ KB

In [75]:
data = pd.concat([x_train, y_train], axis = 1)
data

     티켓등급      성별  형제자매배우자수  부모자식수     운임요금 선착장  PassengerId  Survived
0       3    male         1      0   7.2500   S            1         0
1       1  female         1      0  71.2833   C            2         1
2       3  female         0      0   7.9250   S            3         1
3       1  female         1      0  53.1000   S            4         1
4       3    male         0      0   8.0500   S            5         0
..    ...     ...       ...    ...      ...  ..          ...       ...
886     2    male         0      0  13.0000   S          887         0
887     1  female         0      0  30.0000   S          888         1
888     3  female         1      2  23.4500   S          889         0
889     1    male         0      0  30.0000   C          890         1
890     3    male         0      0   7.7500   Q          891         0

[891 rows x 8 columns]

In [76]:
data.groupby('티켓등급')['Survived'].mean()

티켓등급
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [77]:
data.groupby('성별')['Survived'].mean()

성별
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [78]:
data.groupby('선착장')['Survived'].mean()

선착장
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [79]:
x_train.isnull().sum()

티켓등급        0
성별          0
형제자매배우자수    0
부모자식수       0
운임요금        0
선착장         2
dtype: int64

In [82]:
x_train.groupby('선착장')['선착장'].count()

선착장
C    168
Q     77
S    644
Name: 선착장, dtype: int64

In [85]:
x_train['선착장'].fillna('S', inplace=True)

In [88]:
x_test.isnull().sum()

티켓등급        0
성별          0
형제자매배우자수    0
부모자식수       0
운임요금        1
선착장         0
dtype: int64

In [91]:
sun_dummies = pd.get_dummies(x_train['선착장'], drop_first=True)
sun_dummies.columns = ['선Q', '선S'] 
sun_dummies

     선Q  선S
0     0   1
1     0   0
2     0   1
3     0   1
4     0   1
..   ..  ..
886   0   1
887   0   1
888   0   1
889   0   0
890   1   0

[891 rows x 2 columns]

In [92]:
x_train = pd.concat([x_train, sun_dummies], axis=1)

In [94]:
x_train.drop(columns='선착장', inplace=True)

In [95]:
sun_dummies = pd.get_dummies(x_test['선착장'], drop_first=True)
sun_dummies.columns = ['선Q', '선S'] 
x_test = pd.concat([x_test, sun_dummies], axis=1)
x_test.drop(columns='선착장', inplace=True)

In [96]:
x_train['가족수'] = x_train['형제자매배우자수'] + x_train['부모자식수']
x_train

     티켓등급      성별  형제자매배우자수  부모자식수     운임요금  선Q  선S  가족수
0       3    male         1      0   7.2500   0   1    1
1       1  female         1      0  71.2833   0   0    1
2       3  female         0      0   7.9250   0   1    0
3       1  female         1      0  53.1000   0   1    1
4       3    male         0      0   8.0500   0   1    0
..    ...     ...       ...    ...      ...  ..  ..  ...
886     2    male         0      0  13.0000   0   1    0
887     1  female         0      0  30.0000   0   1    0
888     3  female         1      2  23.4500   0   1    3
889     1    male         0      0  30.0000   0   0    0
890     3    male         0      0   7.7500   1   0    0

[891 rows x 8 columns]

In [97]:
x_train.drop(columns=['형제자매배우자수', '부모자식수'], inplace=True)

In [99]:
x_test['가족수'] = x_test['형제자매배우자수'] + x_test['부모자식수']
x_test.drop(columns=['형제자매배우자수', '부모자식수'], inplace=True)

In [101]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(x_train, y_train, test_size = 0.2, random_state=10)

X_train.shape

(712, 6)

In [106]:
import sklearn
pd.set_option('display.max_rows', None)
dir(sklearn)

['__SKLEARN_SETUP__',
 '__all__',
 '__builtins__',
 '__cached__',
 '__check_build',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_distributor_init',
 '_loss',
 'base',
 'clone',
 'config_context',
 'exceptions',
 'get_config',
 'logger',
 'logging',
 'metrics',
 'model_selection',
 'os',
 'preprocessing',
 'random',
 'set_config',
 'setup_module',
 'show_versions',
 'sys',
 'utils']